Updated charts to use mermaid format for README.md
